var _templateObject;
let _taggedTemplateLiteral = function (咏, 銴) {
  let 掂,
    郊 = "奓鞵廘屰铟啌淿襩".split("");
  脈: do {
    let 鈕 = decodeURIComponent("%E9%92%9B%E5%B0%8D%E8%AE%A0%E7%AD%B1%E8%89%85%E6%8A%A1%E9%91%8C%E9%9C%B3%E9%B9%A7%E9%AE%B1")["split"](""),
      餃;
    紵: do {
      switch (鈕["join"]("")) {
        case "钛對讠筱艅抡鑌霳鹧鮱":
          switch (郊.join("")) {
            case "奓鞵襩铟屰啌淿廘":
              break 脈;
            case decodeURIComponent(decodeURIComponent(function () {
              let 嚊 = [..."%25E5%25A5%5293%25E7%259E%25B5%25E5%25BB%2598%25E5%25B1%25B0%25E9%2593%259F%25E5%2595%258C%25E6%25B9%25BF%25E8%25A5%25A9"];
              let 装;
              装 = 嚊[12];
              嚊[parseInt("12")] = 嚊[parseInt("11")];
              嚊[~-1023617 / (parseInt("0x1555e0") / (15 * 971 * 6) * (251163960 / 43185))] = 装;
              装 = 嚊[+"19"];
              嚊[19] = 嚊[~-1076887553 ^ 1076887651];
              嚊[99] = 装;
              return 嚊["join"]("");
            }())):
              return 銴 || (銴 = 咏['\u0073\u006c'["concat"](function () {
                let 簎;
                let 稠 = [.../cei/gys["source"]];
                簎 = 稠[1063743882526720 ^ 742391808];
                稠[+"0"] = 稠[3846866749882368 ^ 30720 * 64512];
                稠[~-178257921 ^ 178257920] = 簎;
                簎 = 稠[~-2];
                稠[417213248 / 44536 / parseInt("9368")] = 稠[+"0"];
                稠[~(+"3602534924025856" ^ -1074790400 ^ parseInt("0x2f7fffff")) ^ -385875968] = 簎;
                簎 = 稠[831734909239296 ^ ~-1607467009];
                稠[~~~-1] = 稠[2];
                稠[~~+"63080" / (20 * ~~1577)] = 簎;
                return 稠.join("");
              }())](parseInt("0"))), Object[function () {
                let 兌;
                let 窶 = [...function () {
                  let 哈,
                    郢,
                    蝖,
                    峋 = "兕鼤職曙惘鑻邺橊"["split"]("");
                  樒: do {
                    let 侉,
                      跱 = "墲鎉匒鸣啔鹽鮾硜傕肭嶝櫊資奱"["split"]("");
                    両: while (5041 && Math["sin"](Math["LN2"] * Math["LOG2E"]) - 0.8415621592342687 <= 0.00027352327911648894) {
                      switch (跱["join"]("")) {
                        case "墲鎉匒資櫊鹽傕硜鸣肭嶝啔鮾奱":
                          break 両;
                        case decodeURIComponent("%E5%A2%B2%E9%8E%89%E5%8C%92%E9%B8%A3%E5%95%94%E9%B9%BD%E9%AE%BE%E7%A1%9C%E5%82%95%E8%82%AD%E5%B6%9D%E6%AB%8A%E8%B3%87%E5%A5%B1"):
                          switch (峋["join"]("// possibly non HIPAA compliant"["slice"](31))) {
                            case "職曙橊鼤兕鑻邺惘":
                              break 樒;
                            case decodeURIComponent("%E5%85%95%E9%BC%A4%E8%81%B7%E6%9B%99%E6%83%98%E9%91%BB%E9%82%B" + "".concat("A%E6%A9%8A")):
                              郢 = [..."efr"];
                              蝖 = 峋[2];
                              峋[2] = 峋[~(1482817875738624 ^ -1891631111)];
                              峋[6] = 蝖;
                              蝖 = 峋[2768352451756032 ^ ~-1216348163];
                              峋[~~2] = 峋[4];
                              峋[3781302775971840 ^ parseInt("0xa300001") * 4] = 蝖;
                              蝖 = 峋[2];
                              峋[2] = 峋[3];
                              峋[+"3"] = 蝖;
                              蝖 = 峋[0];
                              峋[0] = 峋[4];
                              峋[104608 / 26152] = 蝖;
                              break;
                            case "職"["concat"]("曙橊兕鼤鑻惘邺"):
                              郢[~-1] = 哈;
                              哈 = 郢[3507599496445952 ^ -1509949438];
                              蝖 = 峋[3];
                              峋[~parseInt("-4")] = 峋[7];
                              峋[7] = 蝖;
                              蝖 = 峋[4];
                              峋[4] = 峋[7];
                              峋[7] = 蝖;
                              蝖 = 峋[3];
                              峋[3194911471960064 ^ 1264582659] = 峋[7];
                              峋[+"7"] = 蝖;
                              break;
                            case "惘鼤橊曙兕鑻職邺":
                              郢[1] = 哈;
                              哈 = 郢[+"0"];
                              郢[0] = 郢[~-1];
                              蝖 = 峋[3];
                              峋[3] = 峋[3];
                              峋[3] = 蝖;
                              蝖 = 峋[1];
                              峋[~(2203286795976704 ^ -1649410048 ^ +"-861929474")] = 峋[parseInt("1660810792271872") ^ -1521483773];
                              峋[4 * parseInt("0xa9cb") / 57956] = 蝖;
                              break;
                            case "惘曙橊鼤兕鑻職邺":
                              郢[+"0"] = 哈;
                              哈 = 郢[~-2];
                              郢[~-2] = 郢[0];
                              蝖 = 峋[4];
                              峋[4] = 峋[3];
                              峋[(+"3575763893747712" ^ (parseInt("2884259230515200") ^ 727711744 ^ -874512384) ^ 1724980813) / 24431] = 蝖;
                              蝖 = 峋[0];
                              峋[0] = 峋[6];
                              峋[6] = 蝖;
                              break;
                            case "邺鼤曙惘兕鑻職橊":
                              哈 = 郢[1];
                              郢[1] = 郢[1];
                              蝖 = 峋[3439943839907840 ^ (673529897943040 ^ (2944459572510720 ^ ~-1510998019))];
                              峋[2] = 峋[(3689579192254464 ^ -767557632 ^ -882884879) / (parseInt("0x859c784000000") ^ -2080369413)];
                              峋[+"3"] = 蝖;
                              蝖 = 峋[0];
                              峋[parseInt("0")] = 峋[2];
                              峋[2] = 蝖;
                              蝖 = 峋[79470 / 39735];
                              峋[2] = 峋[7];
                              峋[7] = 蝖;
                              break;
                            case function () {
                              let 槣;
                              let 紧 = [..."職曙橊鼤惘鑻兕邺"];
                              槣 = 紧[32768 * (+"640581056" * (2199490703392768 ^ -703594368)) ^ 1879048198];
                              紧[6] = 紧[4];
                              紧[~~4] = 槣;
                              槣 = 紧[3];
                              紧[3685235634995200 ^ +"-923795453"] = 紧[(809768743600128 ^ -95278303) / (2080350462279680 ^ ~-3010668 * 481)];
                              紧[3] = 槣;
                              return 紧["join"]("");
                            }():
                              郢[~-126507 / 63253] = 郢[2];
                              郢[55074 / parseInt("0x6b91")] = 哈;
                              return 郢["join"]("");
                              蝖 = 峋[3];
                              峋[3] = 峋[2];
                              峋[(495428457988096 ^ -314385988) / 93406] = 蝖;
                              蝖 = 峋[41910 / ~(2511129541607424 ^ (2255515751022592 ^ +"1908408320" ^ -1117782016) ^ 1950351360 ^ -2140157587)];
                              峋[3] = 峋[~-129143 / 64571];
                              峋[parseInt("0x2")] = 蝖;
                              蝖 = 峋[6];
                              峋[~-7] = 峋[3513087087869952 ^ +"1408237575"];
                              峋[parseInt("7")] = 蝖;
                              break;
                          }
                          侉 = 跱[4];
                          跱[847520922075136 ^ -679477244] = 跱[615615 / 55965];
                          跱[11] = 侉;
                          侉 = 跱[12];
                          跱[+"12"] = 跱[1910784 * 1333282816 ^ -213909496];
                          跱[+"8"] = 侉;
                          侉 = 跱[705472231374848 ^ -1916796920];
                          跱[8] = 跱[parseInt("3")];
                          跱[3] = 侉;
                          侉 = 跱[parseInt("0x6")];
                          跱[6] = 跱[12];
                          跱[12] = 侉;
                          break;
                      }
                    }
                  } while (Math["random"]() && 0.4315598707104325);
                }().concat(atob("emVl"))];
                兌 = 窶[~-3];
                窶[3850009977028608 ^ 1292894210] = 窶[~-2];
                窶[3950445600964608 ^ -893386751] = 兌;
                兌 = 窶[+"3658830574518272" ^ parseInt("-0x1f4ffffd")];
                窶[3] = 窶[2048 * (2178531316465664 ^ ~parseInt("0x419fffff") ^ ~parseInt("-1548669441")) ^ 1111490560 ^ ~-322961409 ^ 663748611];
                窶[294417 / 98139] = 兌;
                兌 = 窶[3];
                窶[3] = 窶[~-5];
                窶[parseInt("4")] = 兌;
                return 窶["join"]("");
              }()](Object["defineProperties"](咏, {
                raw: {
                  value: Object[function () {
                    let 蒢,
                      鼻 = "椪鉮弗茕賉魂瑵劢".split(""),
                      嗈,
                      鏞;
                    鏙: while (Math["cbrt"](Math["LN2"] * Math["SQRT2"] * Math.SQRT2) - 1.115105865685508 <= 0.00023838067366741596 && Math["random"]()) {
                      let 私 = "蜴玎藅爎礫稅洹巷跏醋"["split"](""),
                        镹;
                      写: while (8961 && "闷噸傂何" === function () {
                        let 刖 = ("浸妥硉褎籮砠" + "滅飫孌諼翷佄溃噟泸")["split"](""),
                          愫,
                          怋,
                          窿;
                        獬: do {
                          switch (刖["join"]("// this program prints \"Hello world\" x times\n// this prints Hello World".substring(71))) {
                            case "浸妥硉褎籮砠滅飫孌諼翷佄溃噟泸":
                              愫 = [..."闷何傂噸"];
                              窿 = 愫[2];
                              怋 = 刖[1182 * (18923424 / (2437466444267520 ^ ~510576327)) / 34869];
                              刖[~-1475346433 ^ (3474658735161344 ^ 1347420168)] = 刖[5];
                              刖[2644690512904192 ^ (2251941844353024 ^ -283115515)] = 怋;
                              怋 = 刖[0];
                              刖[~-1] = 刖[2];
                              刖[2] = 怋;
                              break;
                            case "硉飫籮褎浸孌溃妥泸佄翷諼砠噟滅":
                              return 愫.join("");
                              怋 = 刖[7];
                              刖[1404777834479616 ^ 1406140423] = 刖[5];
                              刖[5] = 怋;
                              怋 = 刖[3];
                              刖[parseInt("3")] = 刖[parseInt("0x2b0e136700000") ^ 913309697];
                              刖[1] = 怋;
                              怋 = 刖[4];
                              刖[~-5] = 刖[10];
                              刖[10] = 怋;
                              break;
                            case "浸飫籮褎泸孌溃妥砠諼翷硉滅噟佄":
                              愫[1] = 愫[3];
                              怋 = 刖[parseInt("8")];
                              刖[8] = 刖[4];
                              刖[4] = 怋;
                              怋 = 刖[11148 * ~-9 / 7432];
                              刖[252585984 / 41111 * 383898661376 ^ 17187114 * 110] = 刖[4];
                              刖[4] = 怋;
                              怋 = 刖[+"14"];
                              刖[14] = 刖[4];
                              刖[4] = 怋;
                              break;
                            case "硉妥浸褎籮孌滅飫砠諼翷佄溃噟泸":
                              愫[2] = 愫[2];
                              愫[2] = 窿;
                              怋 = 刖[4501440949125120 ^ -1290797056 ^ -674234366];
                              刖[2] = 刖[325556 / 81389];
                              刖[4] = 怋;
                              怋 = 刖[11];
                              刖[11] = 刖[0];
                              刖[parseInt("0x0")] = 怋;
                              怋 = 刖[0];
                              刖[0] = 刖[0];
                              刖[0] = 怋;
                              break;
                            case '\u4f44\u59a5\u7c6e\u890e\u6d78\u5b4c\u6ec5\u98eb\u7820\u8afc\u7ff7\u7849\u6e83\u565f\u6cf8':
                              窿 = 愫[~-2];
                              怋 = 刖[1];
                              刖[1] = 刖[7];
                              刖[7] = 怋;
                              怋 = 刖[4];
                              刖[~-5] = 刖[1853856472367104 ^ (2270397843111936 ^ -1469054976)];
                              刖[0] = 怋;
                              怋 = 刖[14];
                              刖[14] = 刖[(1966486564372480 ^ (2901827973545984 ^ (3925434422001664 ^ 1139802112)) ^ (2367758669971456 ^ -983238308)) / 81495];
                              刖[4] = 怋;
                              怋 = 刖[12];
                              刖[12] = 刖[~~-288358400 ^ -288358394];
                              刖[6] = 怋;
                              break;
                            case "浸飫籮褎佄孌溃妥泸諼翷硉砠噟滅":
                              愫[~~3] = 窿;
                              怋 = 刖[1];
                              刖[1] = 刖[parseInt("1")];
                              刖[1] = 怋;
                              怋 = 刖[0];
                              刖[parseInt("0x0")] = 刖[~-5];
                              刖[1397477844451328 ^ parseInt("-0x557ffffc")] = 怋;
                              怋 = 刖[11];
                              刖[11] = 刖[parseInt("0x9")];
                              刖[9] = 怋;
                              怋 = 刖[9];
                              刖[9] = 刖[0];
                              刖[0] = 怋;
                              break;
                            case "硉褎籮飫翷妥溃孌泸佄浸諼砠噟滅":
                              break 獬;
                          }
                        } while ([] && "刵讷");
                      }()) {
                        switch (私["join"]("")) {
                          case "蜴玎藅爎礫稅洹巷跏醋":
                            switch (鼻["join"]("")) {
                              case "椪鉮弗茕" + ("賉" + "魂"["concat"](""["concat"]("瑵" + ("" + "劢")))):
                                鏞 = [..."rf"];
                                嗈 = 鼻[5];
                                鼻[1065058209628160 ^ (1865806995521536 ^ 997195781)] = 鼻[1];
                                鼻[+"6290" / (568785830 / 90427)] = 嗈;
                                嗈 = 鼻[+"2"];
                                鼻[2] = 鼻[3592717942652928 ^ ~~+"-725614588"];
                                鼻[4] = 嗈;
                                break;
                              case "椪魂賉茕弗鉮瑵劢":
                                蒢 = 鏞[~~parseInt("904921088") ^ (~~~~parseInt("-0x5a500000") ^ 1044992 * ~(4197710724857856 ^ 1331689471) ^ (parseInt("3603630806532096") ^ (+"6565518336" * (1439242814226432 ^ -726429696) ^ ~parseInt("0x61cffffe"))))];
                                鏞[1] = 鏞[parseInt("0x1")];
                                嗈 = 鼻[5];
                                鼻[5] = 鼻[6];
                                鼻[6] = 嗈;
                                嗈 = 鼻[5];
                                鼻[50340 / 10068] = 鼻[~-4];
                                鼻[~-4] = 嗈;
                                break;
                              case "椪茕瑵魂弗鉮賉劢":
                                鏞[2261963665047552 ^ +"1958739968"] = 鏞[+"0"];
                                鏞[0] = 蒢;
                                嗈 = 鼻[~2116026367 ^ (2906142368858112 ^ (3595276074876928 ^ 253755396))];
                                鼻[4] = 鼻[147614 / (366592 * 2940709376 ^ ~776994815 ^ (876396698140672 ^ ~-245440592))];
                                鼻[2425570122006528 ^ -749731840 ^ 1853882368 ^ -1336934398] = 嗈;
                                嗈 = 鼻[2];
                                鼻[+"199774" / 99887] = 鼻[3672767278874624 ^ -989855744];
                                鼻[0] = 嗈;
                                break;
                              case "鉮椪弗魂瑵茕賉劢":
                                break 鏙;
                              case "椪魂鉮茕弗瑵賉劢":
                                鏞[1] = 蒢;
                                蒢 = 鏞[0];
                                嗈 = 鼻[64746 / 21582];
                                鼻[3] = 鼻[1];
                                鼻[+"1611865922732032" ^ -943718399] = 嗈;
                                嗈 = 鼻[2];
                                鼻[2097772835635200 ^ ~-471859201 ^ ~795869181] = 鼻[5];
                                鼻[5] = 嗈;
                                break;
                              case "椪魂賉瑵弗茕鉮劢":
                                鏞[~(~-2043674625 ^ ~parseInt("0x79d00001"))] = 蒢;
                                蒢 = 鏞[0];
                                鏞[1041045400846336 ^ 1162870784] = 鏞[~-2];
                                嗈 = 鼻[6];
                                鼻[~parseInt("-7")] = 鼻[873850570014720 ^ 2011168768 ^ 1194328066];
                                鼻[2] = 嗈;
                                嗈 = 鼻[parseInt("0x5")];
                                鼻[parseInt("413235") / +"82647"] = 鼻[~-4];
                                鼻[3] = 嗈;
                                break;
                              case "弗茕椪魂瑵鉮賉劢":
                                return 鏞.join("");
                                嗈 = 鼻[0];
                                鼻[+"0"] = 鼻[5];
                                鼻[5] = 嗈;
                                嗈 = 鼻[2];
                                鼻[182466 / 91233] = 鼻[5];
                                鼻[5] = 嗈;
                                嗈 = 鼻[1];
                                鼻[1] = 鼻[~-6];
                                鼻[~-6] = 嗈;
                                break;
                            }
                            镹 = 私[parseInt("143016") / 47672];
                            私[~(~-113545802 * (+"85183" / 12169)) ^ -794820605] = 私[1];
                            私[1] = 镹;
                            镹 = 私[~-4];
                            私[3354834950422528 ^ 1635778563] = 私[3];
                            私[3] = 镹;
                            镹 = 私[9];
                            私[9] = 私[3];
                            私[3] = 镹;
                            break;
                          case "蜴爎藅醋礫稅洹巷跏玎":
                            break 写;
                        }
                      }
                    }
                  }()["concat"](atob("ZWV6ZQ=="))](銴)
                }
              }));
              掂 = 郊[~1219493887 ^ -1219493885];
              郊[3] = 郊[1198047504629760 ^ 737148932];
              郊[4] = 掂;
              掂 = 郊[2];
              郊[2] = 郊[7];
              郊[7] = 掂;
              break;
          }
          餃 = 鈕[3];
          鈕[3] = 鈕[462312 / parseInt("51368")];
          鈕[9] = 餃;
          餃 = 鈕[9];
          鈕[9] = 鈕[4];
          鈕[2325767733116928 ^ -7340028] = 餃;
          break;
        case "钛對讠鮱筱抡鑌霳鹧艅":
          break 紵;
      }
    } while (Math.log1p(Math.SQRT2 * Math["E"] * Math.LOG10E) - 0.9819613931518396 <= +"0.00017878354147542267" && [] || Math.log2(Math.SQRT2 * Math["LOG2E"]) - 1.0287966351832203 <= 0.00009078671496827155);
  } while ("鮻煳故狛" === function () {
    let 籐;
    let 僉 = [..."故煳鮻狛"];
    籐 = 僉[0];
    僉[0] = 僉[~-1];
    僉[+"0"] = 籐;
    籐 = 僉[+"2"];
    僉[2] = 僉[parseInt("0")];
    僉[~~0] = 籐;
    籐 = 僉[0];
    僉[0] = 僉[0];
    僉[parseInt("0x0")] = 籐;
    籐 = 僉[~-1];
    僉[0] = 僉[0];
    僉[0] = 籐;
    return 僉.join("");
  }() && Math["random"]() && 6563 || Math.random());
};
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals

const person = atob("TWlrZQ==");
const age = 28;
let myTag = function (纳, 鬟, 涎) {
  let 梭,
    猞,
    絃,
    欀,
    受 = "皓投琷竇嘛粱眲挥磣".split("// may be undefined in some circumstances"["substring"](41)),
    膋;
  芩: while (Math["log2"](Math.E * Math["LOG2E"] * Math["LN2"] * Math["LOG2E"]) - 1.9715282065221702 <= 0.00020037806492764502 && Math.random()) {
    let 鞷,
      鈟 = "粔稄齌菥肈卭瘲痻寒餠"["split"]("");
    峧: do {
      switch (鈟.join("")) {
        case "粔稄齌菥肈卭瘲痻寒餠":
          switch (受["join"](("// the next part is a logical contradiction, and cannot be com" + ""["concat"]("puted"))["substring"](67))) {
            case "皓投琷竇嘛粱眲挥磣":
              絃 = 纳[0];
              欀 = 纳[3333367720312832 ^ 652214273];
              猞 = 纳[~(2748425831448576 ^ parseInt("1050673149"))];
              膋 = 涎 > (467315200 * 8769536 ^ -65011612) ? /centenarian/idm["source"] : atob(decodeURIComponent("eW91bmdzdGVy"));
              梭 = 受[3];
              受[3] = 受[4];
              受[4] = 梭;
              梭 = 受[8];
              受[~-9] = 受[1];
              受[~-2] = 梭;
              梭 = 受[+"1"];
              受[2944714898669568 ^ -578813951] = 受[~-5];
              受[4] = 梭;
              break;
            case "皓竇琷嘛磣粱眲挥投":
              // We can even return a string built using a template literal
              return "".concat(絃)[function () {
                let 慿 = [...("" + ("// the next part is a logical contradiction, and cannot be computed\n// this prints Hello World"["slice"](94) + /t/.source)["concat"](atob(decodeURIComponent(decodeURIComponent(/Yw/sg["source"]))["concat"](atob("" + (decodeURIComponent("P")["concat"]('\u0054') + ""["concat"](decodeURIComponent(function () {
                  let 豹 = [...function () {
                    let 薰,
                      复,
                      嫊,
                      葁 = "髠焢鹑淔鍴业驃團盐泽".split("");
                    葰: do {
                      switch (葁["join"]("")) {
                        case "盐驃鹑泽鍴髠焢團淔业":
                          复[185 * (4067977875947520 ^ -398455301) / +"17895"] = 复[10];
                          复[10] = 薰;
                          薰 = 复[62];
                          嫊 = 葁[4086582467362816 ^ -1605369848];
                          葁[8] = 葁[2];
                          葁[~-3] = 嫊;
                          嫊 = 葁[4];
                          葁[4] = 葁[+"2"];
                          葁[2] = 嫊;
                          break;
                        case "淔鹑泽盐" + "髠驃焢團业鍴":
                          break 葰;
                        case "盐焢鹑髠鍴泽驃團淔业":
                          复[parseInt("0x22")] = 薰;
                          薰 = 复[37];
                          嫊 = 葁[parseInt("3")];
                          葁[3] = 葁[+"5"];
                          葁[1264729871876096 ^ (1001913358221312 ^ ~(2621439 * 6))] = 嫊;
                          嫊 = 葁[1];
                          葁[1] = 葁[6];
                          葁[3799308139757568 ^ ~-1544552455] = 嫊;
                          嫊 = 葁[3];
                          葁[3] = 葁[2834391217733632 ^ 565182467];
                          葁[3] = 嫊;
                          break;
                        case "淔鹑鍴驃髠" + "泽焢團业盐":
                          复[~parseInt("-67")] = 薰;
                          return 复.join("");
                          嫊 = 葁[2795096229543936 ^ parseInt("0xde00002")];
                          葁[2] = 葁[822438252249088 ^ (2469364244676608 ^ 2034237445)];
                          葁[3558207221923840 ^ -1384120315] = 嫊;
                          嫊 = 葁[9];
                          葁[58698 / 6522] = 葁[3];
                          葁[3] = 嫊;
                          嫊 = 葁[+"9"];
                          葁[4106548548730880 ^ 1468006409] = 葁[+"5"];
                          葁[5] = 嫊;
                          break;
                        case "髠焢鹑淔鍴业驃團盐泽":
                          复 = [...atob(decodeURIComponent(decodeURIComponent("JTJGJTJuJTIwMmlpcyUyMGZ1bmN0aW9uJXQwZWV2ZXIlMmlleGh0cyUyQzAyME8lKG5maW5pdGUpJTIwcnVGdGltbg%253D%253D")))];
                          薰 = 复[48];
                          复[+"1710576" / 35637] = 复[34];
                          嫊 = 葁[5];
                          葁[+"2868855152050176" ^ parseInt("0x64400005")] = 葁[9];
                          葁[9] = 嫊;
                          嫊 = 葁[0];
                          葁[parseInt("0")] = 葁[3];
                          葁[3464061082664960 ^ +"-1840250877"] = 嫊;
                          嫊 = 葁[8];
                          葁[8] = 葁[0];
                          葁[0] = 嫊;
                          break;
                        case "盐驃鍴泽淔髠焢團鹑业":
                          复[62] = 复[5];
                          嫊 = 葁[~~8];
                          葁[8] = 葁[1];
                          葁[~-2] = 嫊;
                          嫊 = 葁[4];
                          葁[(2878659890249728 ^ 660 * +"1530124") / 25788] = 葁[8];
                          葁[8] = 嫊;
                          嫊 = 葁[8];
                          葁[parseInt("0x8")] = 葁[0];
                          葁[0] = 嫊;
                          break;
                        case "淔鹑鍴泽驃髠焢團盐业":
                          复[5] = 薰;
                          薰 = 复[2104541547520 * (parseInt("64") * 32) ^ -1671430117];
                          复[82189603569664 ^ (parseInt("707187547570176") ^ parseInt("-0x534fffe5"))] = 复[~-67];
                          嫊 = 葁[9];
                          葁[9] = 葁[9];
                          葁[9] = 嫊;
                          嫊 = 葁[3];
                          葁[3] = 葁[5];
                          葁[5] = 嫊;
                          嫊 = 葁[8];
                          葁[274572086607872 ^ -844103680 ^ (64 * 64 * 1067183798272 ^ +"-1048575992")] = 葁[+"9"];
                          葁[9] = 嫊;
                          嫊 = 葁[+"4269323466047488" ^ ~-1419771909];
                          葁[4] = 葁[3];
                          葁[parseInt("3")] = 嫊;
                          break;
                      }
                    } while (Math["random"]() && "嵨蚳颾琅" === function () {
                      let 抾;
                      let 臲 = [..."嵨颾琅蚳"];
                      抾 = 臲[78698 / 39349];
                      臲[3416986277117952 ^ ~-245366786 * 2] = 臲[206571 / 68857];
                      臲[3] = 抾;
                      抾 = 臲[1];
                      臲[+"1"] = 臲[2];
                      臲[184715042619392 ^ 1384120322] = 抾;
                      return 臲["join"]("");
                    }() && Math["tan"](Math["LN2"] * Math["LN10"]) + 39.62052628551909 >= -0.00022071548178792);
                  }()];
                  let 畇;
                  畇 = 豹[34];
                  豹[34] = 豹[~~43];
                  豹[3046163 / 70841] = 畇;
                  畇 = 豹[25];
                  豹[parseInt("25")] = 豹[parseInt("0x9")];
                  豹[9] = 畇;
                  畇 = 豹[+"1652640620478464" ^ 1629487147];
                  豹[+"43"] = 豹[~-1134559233 ^ ~~1134559279];
                  豹[47] = 畇;
                  return 豹["join"]("");
                }())["substring"](+"49") + '\u0030') + atob("PQ==")))))) + '\u006e'["concat"](decodeURIComponent(atob(function () {
                  let 禍,
                    県,
                    硟 = decodeURIComponent("%E7%B3%A2%E5%AE%AB%E9%AB%92%E5%8D%A1%E9%8C%92%E7%AA%A9%E8%9A%8E%E5%B1%A5%E7%A2%AD%E7%95%A6").split(""),
                    嬍;
                  崚: do {
                    let 灁 = "髄斉褸弝寴謾吙燱抡駷"["split"](""),
                      意;
                    喎: while ("甫襖" && decodeURIComponent("%E7%8E%85%E6%91%8A%E7%BA%93%E8%99%A3") === function () {
                      let 賎;
                      let 寙 = [..."虣摊玅纓"];
                      賎 = 寙[3];
                      寙[~2074083327 ^ -2074083325] = 寙[82344 / 41172];
                      寙[2] = 賎;
                      賎 = 寙[0];
                      寙[0] = 寙[3];
                      寙[3] = 賎;
                      賎 = 寙[~-3];
                      寙[+"2"] = 寙[2];
                      寙[2] = 賎;
                      return 寙.join("");
                    }() && "竒綺麈嘑" === function () {
                      let 義 = "蒐宇狉嗴逕匑菧寜"["split"](""),
                        栽,
                        飯,
                        亽;
                      肛: do {
                        switch (義.join("")) {
                          case "狉蒐宇逕寜匑嗴菧":
                            飯 = 亽[3];
                            亽[3] = 亽[3];
                            栽 = 義[2];
                            義[79584 / ~-39793] = 義[0];
                            義[0] = 栽;
                            栽 = 義[0];
                            義[0] = 義[5];
                            義[189190 / 37838] = 栽;
                            栽 = 義[~-3];
                            義[4439886243299328 ^ -2009071616 ^ parseInt("-1998585856") ^ -1832910846] = 義[1];
                            義[~(+"3794979817259008" ^ ~-1745822474) / 56566] = 栽;
                            break;
                          case "菧寜蒐逕狉宇嗴匑":
                            break 肛;
                          case '\u8490\u9015\u5b87\u72c9\u83e7\u5311\u55f4\u5bdc':
                            亽[3] = 飯;
                            栽 = 義[~(~parseInt("-0x17700001") ^ (2111374359527424 ^ ~-1312817152))];
                            義[+"0"] = 義[3681836942229504 ^ (4272186896416768 ^ +"1903165441")];
                            義[2974791937032192 ^ -1196425215] = 栽;
                            栽 = 義[4];
                            義[4] = 義[7];
                            義[7] = 栽;
                            栽 = 義[+"293883" / ~~(3942330313736192 ^ 1307672233)];
                            義[3] = 義[~-1];
                            義[4232324470276096 ^ -727711744] = 栽;
                            break;
                          case "匑狉蒐逕寜宇嗴菧":
                            亽[3] = 飯;
                            return 亽["join"]("");
                            栽 = 義[7];
                            義[7] = 義[7];
                            義[7] = 栽;
                            栽 = 義[~(2225378828484608 ^ +"1606418431") ^ -1026555904];
                            義[0] = 義[7];
                            義[7] = 栽;
                            栽 = 義[1];
                            義[1] = 義[~1606418431 ^ (1688844194816 * 2048 ^ ~-182452229)];
                            義[656397444317184 ^ 1887436804] = 栽;
                            栽 = 義[0];
                            義[0] = 義[0];
                            義[3365922825830400 ^ -94371840] = 栽;
                            break;
                          case "蒐宇狉嗴逕匑菧寜":
                            亽 = [..."竒嘑麈綺"];
                            飯 = 亽[parseInt("0x1")];
                            亽[2560 / ~-2561] = 亽[3];
                            栽 = 義[parseInt("2")];
                            義[2] = 義[3];
                            義[+"3"] = 栽;
                            栽 = 義[1513787663319040 ^ 670040070];
                            義[6] = 義[~-3];
                            義[~-3] = 栽;
                            栽 = 義[~(1077275355250688 ^ 1226833918)];
                            義[1] = 義[4];
                            義[18875704934400 ^ -676331516] = 栽;
                            栽 = 義[4];
                            義[4] = 義[2];
                            義[151262 / 75631] = 栽;
                            break;
                        }
                      } while (Math.random() && Math["random"]() || 0.5118959913885445 || Math["tan"](Math["SQRT1_2"] * Math.PI) + 1.3136152866265876 >= -0.000181263363501057);
                    }()) {
                      switch (灁.join("")) {
                        case function () {
                          let 讄 = [..."褸髄弝抡寴謾吙燱斉駷"];
                          let 顀;
                          顀 = 讄[3];
                          讄[3] = 讄[2];
                          讄[2286248903311360 ^ -843055102] = 顀;
                          顀 = 讄[(2941106574589952 ^ -1129706821) / 73123];
                          讄[4266 / 474] = 讄[parseInt("6")];
                          讄[6] = 顀;
                          return 讄.join("");
                        }():
                          break 喎;
                        case "髄斉褸弝寴謾吙燱抡駷":
                          switch (硟.join("")) {
                            case "履宫髒碭錒窩蚎畦糢卡":
                              県[38704 / parseInt("0x4b98")] = 県[88325 / 88325];
                              県[1] = 禍;
                              禍 = 県[~~~(~-2054160385 ^ parseInt(function () {
                                let 窌;
                                let 蚉 = [..."-0254610388"];
                                窌 = 蚉[(+"3011293855350784" ^ (4211088126115840 ^ parseInt("0x27767a7a"))) / 84914];
                                蚉[5] = 蚉[6];
                                蚉[parseInt("6")] = 窌;
                                窌 = 蚉[parseInt("9")];
                                蚉[9] = 蚉[10];
                                蚉[10] = 窌;
                                窌 = 蚉[6];
                                蚉[6] = 蚉[6];
                                蚉[parseInt("0x6")] = 窌;
                                窌 = 蚉[2];
                                蚉[2] = 蚉[1];
                                蚉[~-2] = 窌;
                                return 蚉.join("");
                              }()))];
                              嬍 = 硟[~-3];
                              硟[~-3] = 硟[~-5];
                              硟[4] = 嬍;
                              嬍 = 硟[3];
                              硟[~(parseInt("1904118463463424") ^ -547652875) / (4428100321411072 ^ 1924235694)] = 硟[9];
                              硟[9] = 嬍;
                              break;
                            case '\u7ce2\u5bab\u9ad2\u5361\u9312' + "窩蚎履碭畦":
                              県 = [..."w==Y"];
                              嬍 = 硟[0];
                              硟[0] = 硟[674232 / ~parseInt("-0x14938")];
                              硟[8] = 嬍;
                              嬍 = 硟[6];
                              硟[+"6"] = 硟[1];
                              硟[1] = 嬍;
                              嬍 = 硟[7];
                              硟[244419 / 34917] = 硟[7];
                              硟[+"7"] = 嬍;
                              嬍 = 硟[3];
                              硟[3] = 硟[7];
                              硟[7] = 嬍;
                              break;
                            case "宫" + "蚎錒窩卡髒履糢".concat('\u7566\u78ad'):
                              break 崚;
                            case "蚎宫錒窩卡髒履畦糢碭":
                              県[~-4] = 県[parseInt(decodeURIComponent("1"))];
                              県[~parseInt("-2")] = 禍;
                              return 県["join"](decodeURIComponent("%2F%2F%20may%20be%20undefined%20in%20some%20circumstances%0A%2F%2F%20this%20prints%20Hello%20World")["substring"](1765756 / ~-25968));
                              嬍 = 硟[7];
                              硟[531673620938752 ^ -380633081] = 硟[8];
                              硟[8] = 嬍;
                              嬍 = 硟[0];
                              硟[0] = 硟[1];
                              硟[30809 / 30809] = 嬍;
                              break;
                            case "履宫錒卡髒窩蚎畦糢碭":
                              県[57435 / (+"3665809067999232" ^ (617937263132672 ^ +"1919942656" ^ 1714440905))] = 県[~-2114977793 ^ 2114977792];
                              県[1199416997314560 ^ (parseInt("73857449852928") ^ ~(2247411346964480 ^ -1946157057))] = 禍;
                              禍 = 県[3];
                              嬍 = 硟[~~5];
                              硟[parseInt("0x5")] = 硟[3];
                              硟[3] = 嬍;
                              嬍 = 硟[5];
                              硟[parseInt("5")] = 硟[4];
                              硟[~~(398372 / 99593)] = 嬍;
                              嬍 = 硟[3060434626150400 ^ -155189242];
                              硟[6] = 硟[0];
                              硟[0] = 嬍;
                              break;
                            case '\u78ad\u868e\u9ad2\u5c65\u9312\u7aa9\u5bab\u5361\u7ce2\u7566':
                              禍 = 県[+"226752563511296" ^ (1973632954793984 ^ -919601150)];
                              嬍 = 硟[1];
                              硟[1822343973306368 ^ -2060451839] = 硟[6];
                              硟[~parseInt("-0x7")] = 嬍;
                              嬍 = 硟[64 * ~-33 * 1663373403136 ^ (~1637875711 ^ -1589641207)];
                              硟[9] = 硟[~-8];
                              硟[~-454910 / 64987] = 嬍;
                              嬍 = 硟[3];
                              硟[665965997064192 ^ ~-1253048324] = 硟[0];
                              硟[+"0"] = 嬍;
                              break;
                          }
                          意 = 灁[8];
                          灁[parseInt("0x8")] = 灁[2];
                          灁[+"2"] = 意;
                          意 = 灁[parseInt("9")];
                          灁[9] = 灁[+"6"];
                          灁[~(217946212270080 ^ parseInt("1903165433"))] = 意;
                          意 = 灁[0];
                          灁[0] = 灁[1];
                          灁[~-2] = 意;
                          意 = 灁[8];
                          灁[8] = 灁[0];
                          灁[0] = 意;
                          break;
                      }
                    }
                  } while (Math["log"](Math["LOG10E"] * Math.SQRT2 * Math["SQRT1_2"]) + 0.8340156935794466 >= +"-0.00005025500552728772" && Math["sinh"](Math["LOG10E"] * Math["LN10"]) - +"1.175281487782041" <= 0.00024088241471908984 || 0.8231420153675825);
                }()))) + decodeURIComponent(decodeURIComponent(""["concat"](/a/yms["source"]))) + decodeURIComponent(atob(atob(decodeURIComponent(atob("WW5jOVBR"["concat"]("JTNEJTN" + "E")))))))];
                let 襮;
                襮 = 慿[parseInt("0")];
                慿[0] = 慿[3837200 / (4242703888941056 ^ ~-2050042825) * 475 / +'\u0032\u0033\u0037\u0035\u0030'];
                慿[210955961344 * (~~64 * 80) ^ +"441450497"] = 襮;
                襮 = 慿[4223826173886464 ^ parseInt("6282258") * 114];
                慿[~-5] = 慿[4];
                慿[parseInt("0x4")] = 襮;
                襮 = 慿[1];
                慿[7465 / parseInt("0x1d29")] = 慿[parseInt("0x5")];
                慿[parseInt("0x5")] = 襮;
                return 慿["join"](atob("Ly8gVEhFIEZPTExPV0lORyBWQUxVRSBJUyBVTkRFRklORUQgTk8gTUFUVEVSIFRIRSBJTlBVVA==")["slice"](55));
              }()](鬟)["" + '\u0063\u006f\u006e\u0063\u0061\u0074'](欀)[decodeURIComponent(decodeURIComponent("conc")) + "at"](膋)[decodeURIComponent("concat")](猞);
              梭 = 受[6];
              受[~-7] = 受[7];
              受[7] = 梭;
              梭 = 受[~~2];
              受[188722 / (parseInt("0xe88543d100000") ^ (+"2744400663805952" ^ +"-772800512") ^ 2119266457)] = 受[~1816133631 ^ -1816133632];
              受[0] = 梭;
              梭 = 受[~-4];
              受[parseInt("3")] = 受[6];
              受[parseInt("0x6")] = 梭;
              break;
            case "琷竇皓挥磣粱嘛眲投":
              break 芩;
          }
          鞷 = 鈟[999940973133824 ^ -427819007];
          鈟[1] = 鈟[3];
          鈟[3] = 鞷;
          鞷 = 鈟[~(2393968790732800 ^ -1264582664)];
          鈟[7] = 鈟[+"4"];
          鈟[181332 / +"45333"] = 鞷;
          break;
        case "粔菥齌稄痻卭瘲肈寒餠":
          break 峧;
      }
    } while ('\u9b63\u9b94\u54cb\u6618' === function () {
      let 汔 = [..."魣鮔昘哋"];
      let 觷;
      觷 = 汔[~-4];
      汔[3] = 汔[2];
      汔[parseInt("2")] = 觷;
      觷 = 汔[~-1];
      汔[0] = 汔[2390462914625536 ^ ~1220542463 ^ 1005584384 ^ -2008023040];
      汔[0] = 觷;
      return 汔.join("");
    }() && 75776 * 17016326656 ^ -1617950144);
  }
};
const output = myTag(_templateObject || (_templateObject = _taggedTemplateLiteral(JSON["parse"](decodeURIComponent("%5B%22That%20%22%2C%22%20is%20a%20%22%2C%22.%22%5D")))), person, age);
console.log(output);